![Königsweg Logo](../img/koenigsweg_150.png)

<span style="font-size: small;float: right;">&copy; 2015-2020 Alexander C.S. Hendorf, <a href="http://koenigsweg.com">Königsweg GmbH</a>, Mannheim </span>

---

# Analytics with  Pandas and Jupyterlab

---

# Reading and Writing Data Across Multiple Formats

---

A practical start into Pandas.

In [1]:
import pandas as pd

*import as pd* is a widely used convention

in our data directory we have some files stored from the *Blooth store*, *let's import one*!

In [2]:
%pwd

'/Users/hendorf/code/pydata-pandas-workshop/notebooks'

In [3]:
%ls ../data

blooth_sales_data.csv
blooth_sales_data.html
blooth_sales_data.json
blooth_sales_data.xlsx
blooth_sales_data_2.csv
blooth_sales_data_big.json
blooth_sales_data_big.json.parquet.gzip
blooth_sales_data_big.xlsx
blooth_sales_data_clean.csv
blooth_sales_data_clean.xlsx
blooth_sales_data_clean_1.csv
blooth_sales_data_clean_2.csv
blooth_sales_data_clean_3.csv
sales_data_json_exported.xlsx
sampledf.json
temp.csv*

In [4]:
sales_data = pd.read_csv('../data/blooth_sales_data.csv')

### Let's explore our data set

In [6]:
pd.set_option('display.max_rows', 10)  # change presets for data preview
sales_data

,name,birthday,customer,orderdate,product,units,unitprice
0,Pasquale,1967-09-02,Electronics Inc,2016-07-17 13:48:03.156566,Thriller record,2,13.27
1,India,1968-12-13,Electronics Resource Group,2016-07-06 13:48:03.156596,Corolla,26,24458.69
2,Wayne,1992-09-10,East Application Contract Inc,2016-07-22 13:48:03.156618,Rubik’s Cube,41,15.79
3,Cori,1986-11-05,Signal Industries,2016-07-23 13:48:03.156638,iPhone,16,584.01
4,Chang,1972-04-23,Star Alpha Industries,2016-07-16 13:48:03.156657,Harry Potter book,4,25.69
...,...,...,...,...,...,...,...
995,Ethan,1952-12-08,Application Industries,2016-07-21 13:48:03.177885,Harry Potter book,39,24.40
996,Rudolph,1959-10-15,Network Software West Inc,2016-07-19 13:48:03.177903,Rubik’s Cube,9,15.11
997,Annmarie,1982-06-04,Atlantic Corporation,2016-07-13 13:48:03.177924,Thriller record,19,9.16
998,Chang,1984-02-05,Venture Alpha Corporation,2016-07-13 13:48:03.177943,Harry Potter book,24,28.21
999,Ervin,1977-10-14,Provider Agency,2016-07-09 13:48:03.177962,iPhone,39,663.83

In [7]:
pd.reset_option('display.max_rows')

#### Let's see what we have got now

In [8]:
type(sales_data)

pandas.core.frame.DataFrame

In [9]:
len(sales_data)

1000

#### Inspect your DataFrame with pandas methods

In [10]:
sales_data.head(10)

,name,birthday,customer,orderdate,product,units,unitprice
0,Pasquale,1967-09-02,Electronics Inc,2016-07-17 13:48:03.156566,Thriller record,2,13.27
1,India,1968-12-13,Electronics Resource Group,2016-07-06 13:48:03.156596,Corolla,26,24458.69
2,Wayne,1992-09-10,East Application Contract Inc,2016-07-22 13:48:03.156618,Rubik’s Cube,41,15.79
3,Cori,1986-11-05,Signal Industries,2016-07-23 13:48:03.156638,iPhone,16,584.01
4,Chang,1972-04-23,Star Alpha Industries,2016-07-16 13:48:03.156657,Harry Potter book,4,25.69
5,Weldon,1953-03-17,Network Application Co,2016-07-22 13:48:03.156678,Lipitor,1,11.22
6,Sung,1977-10-23,Omega Pacific Future Incorporated,2016-07-09 13:48:03.156698,PlayStation,25,294.90
7,Emily,1982-07-02,Medicine Incorporated,2016-07-16 13:48:03.156717,Thriller record,5,18.27
8,Cornell,1963-07-02,Technology Direct Star Limited,2016-07-08 13:48:03.156735,Rubik’s Cube,35,15.98
9,Ervin,1977-10-14,Provider Agency,2016-07-19 13:48:03.156754,Star Wars,24,11.50

In [11]:
sales_data.tail(5)

,name,birthday,customer,orderdate,product,units,unitprice
995,Ethan,1952-12-08,Application Industries,2016-07-21 13:48:03.177885,Harry Potter book,39,24.40
996,Rudolph,1959-10-15,Network Software West Inc,2016-07-19 13:48:03.177903,Rubik’s Cube,9,15.11
997,Annmarie,1982-06-04,Atlantic Corporation,2016-07-13 13:48:03.177924,Thriller record,19,9.16
998,Chang,1984-02-05,Venture Alpha Corporation,2016-07-13 13:48:03.177943,Harry Potter book,24,28.21
999,Ervin,1977-10-14,Provider Agency,2016-07-09 13:48:03.177962,iPhone,39,663.83

In [12]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
name         1000 non-null object
birthday     1000 non-null object
customer     1000 non-null object
orderdate    1000 non-null object
product      1000 non-null object
units        1000 non-null int64
unitprice    1000 non-null float64
dtypes: float64(1), int64(1), object(5)
memory usage: 54.8+ KB

**note: floats and ints were detected automatically but date(time) are still strings objects**

* *columns*
* count rows
* data types (numpy)
* memenory used

**`Strings`** are stored in **`pandas`** as **`object`**!

In [ ]:
?pd.read_csv

**`pandas.read_csv`** has more than 50 parameters to customize imports.

For example dates can be parsed automatically.

> **`parse_dates`** a list of columns to parse for dates.

This is only one of multiple options to customize imports.

In [13]:
sales_data = pd.read_csv('../data/blooth_sales_data.csv',
                         parse_dates=['birthday', 'orderdate']
                        )
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
name         1000 non-null object
birthday     1000 non-null datetime64[ns]
customer     1000 non-null object
orderdate    1000 non-null datetime64[ns]
product      1000 non-null object
units        1000 non-null int64
unitprice    1000 non-null float64
dtypes: datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 54.8+ KB

In [14]:
sales_data.head(5)

,name,birthday,customer,orderdate,product,units,unitprice
0,Pasquale,1967-09-02,Electronics Inc,2016-07-17 13:48:03.156566,Thriller record,2,13.27
1,India,1968-12-13,Electronics Resource Group,2016-07-06 13:48:03.156596,Corolla,26,24458.69
2,Wayne,1992-09-10,East Application Contract Inc,2016-07-22 13:48:03.156618,Rubik’s Cube,41,15.79
3,Cori,1986-11-05,Signal Industries,2016-07-23 13:48:03.156638,iPhone,16,584.01
4,Chang,1972-04-23,Star Alpha Industries,2016-07-16 13:48:03.156657,Harry Potter book,4,25.69

The auto date parser is US date friendly by default -> month first! MM/DD/YYYY add *dayfirst=True* for international and European format.

In [ ]:
sales_data = pd.read_csv('../data/blooth_sales_data.csv',
                         parse_dates=['birthday', 'orderdate'],
                         dayfirst=True)
sales_data.head(5)

**!** The date parse is US datew friendly! *MM/DD/YYYY*

To use the more common international format for sure,<br>
add 
>**`dayfirst=True`**

The CSV import may be highly customized, <br>e.g.:

* `date_parser` - which columns to parse.
* `compression` - `pandas` hint compression of file, default: `infer`- auto discovery
* `delimiter` - delimiter
* `thousands`, `decimal` - thousands or decimal character
* `encoding` - encoding of the file
* `dtype`- target data type of column(s)
* `header`- header number(s)
* `skipfooter`- do not import the footer (e.g. summary line)

### Excercise

Repeat what you just have learned above:
* `.head()`

In [ ]:
# your code here

In [16]:
# %load ../solutions/101.py
sales_data.head(7)

,name,birthday,customer,orderdate,product,units,unitprice
0,Pasquale,1967-09-02,Electronics Inc,2016-07-17 13:48:03.156566,Thriller record,2,13.27
1,India,1968-12-13,Electronics Resource Group,2016-07-06 13:48:03.156596,Corolla,26,24458.69
2,Wayne,1992-09-10,East Application Contract Inc,2016-07-22 13:48:03.156618,Rubik’s Cube,41,15.79
3,Cori,1986-11-05,Signal Industries,2016-07-23 13:48:03.156638,iPhone,16,584.01
4,Chang,1972-04-23,Star Alpha Industries,2016-07-16 13:48:03.156657,Harry Potter book,4,25.69
5,Weldon,1953-03-17,Network Application Co,2016-07-22 13:48:03.156678,Lipitor,1,11.22
6,Sung,1977-10-23,Omega Pacific Future Incorporated,2016-07-09 13:48:03.156698,PlayStation,25,294.90

* `.tail()`

In [17]:
# your code here

In [18]:
# %load ../solutions/102.py
sales_data.tail(27)

* `.info()`

In [ ]:
# your code here

In [19]:
# %load ../solutions/103.py
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
name         1000 non-null object
birthday     1000 non-null datetime64[ns]
customer     1000 non-null object
orderdate    1000 non-null datetime64[ns]
product      1000 non-null object
units        1000 non-null int64
unitprice    1000 non-null float64
dtypes: datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 54.8+ KB

Read the file 'blooth_sales_data_2.csv' from the directory *data* and save it to a variable called *data2*.

In [21]:
# your code here
!head '../data/blooth_sales_data_2.csv'

name;birthday;customer;orderdate;product;units;unitprice
Renita;1992-09-30;Industries International;2016-10-07 09:14:17.476376;Harry Potter book;44;17,74
Dominick;1979-07-26;Solutions Co;2016-10-09 09:14:17.476409;banana;33;10,0
Sasha;1986-05-08;Power LLC;2016-10-19 09:14:17.476433;Harry Potter book;39;15,58
Duncan;1958-07-04;Research Net Co;2016-10-09 09:14:17.476455;Corolla;48;24609,93
Frederick;1983-07-24;Building Max East Inc;2016-10-09 09:14:17.476476;Rubik’s Cube;21;16,73
Chance;1982-11-24;Max South Venture Organization;2016-10-18 09:14:17.476496;PlayStation;8;206,58
Magdalene;1983-11-28;Universal Agency;2016-10-12 09:14:17.476517;Harry Potter book;25;8,36
Lissette;1967-07-18;Frontier Hardware Industries;2016-10-08 09:14:17.476537;Lipitor;28;11,09
Zane;1981-12-31;Virtual Corporation;2016-10-02 09:14:17.476557;banana;15;10,0

In [20]:
# %load ../solutions/104.py
data2 = pd.read_csv('../data/blooth_sales_data_2.csv')
data2.head()

                                                    name;birthday;customer;orderdate;product;units;unitprice
Renita;1992-09-30;Industries International;2016...                                                 74
Dominick;1979-07-26;Solutions Co;2016-10-09 09:...                                                  0
Sasha;1986-05-08;Power LLC;2016-10-19 09:14:17....                                                 58
Duncan;1958-07-04;Research Net Co;2016-10-09 09...                                                 93
Frederick;1983-07-24;Building Max East Inc;2016...                                                 73

Use the parameters on import to make the import in a useful format

In [ ]:
# your code here

In [23]:
# %load ../solutions/105.py
data2 = pd.read_csv('../data/blooth_sales_data_2.csv', sep=';', decimal=',', parse_dates=['birthday', 'orderdate'])
data2.head()

,name,birthday,customer,orderdate,product,units,unitprice
0,Renita,1992-09-30,Industries International,2016-10-07 09:14:17.476376,Harry Potter book,44,17.74
1,Dominick,1979-07-26,Solutions Co,2016-10-09 09:14:17.476409,banana,33,10.00
2,Sasha,1986-05-08,Power LLC,2016-10-19 09:14:17.476433,Harry Potter book,39,15.58
3,Duncan,1958-07-04,Research Net Co,2016-10-09 09:14:17.476455,Corolla,48,24609.93
4,Frederick,1983-07-24,Building Max East Inc,2016-10-09 09:14:17.476476,Rubik’s Cube,21,16.73

In [24]:
# check your import using .info()
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2345 entries, 0 to 2344
Data columns (total 7 columns):
name         2345 non-null object
birthday     2345 non-null datetime64[ns]
customer     2345 non-null object
orderdate    2345 non-null datetime64[ns]
product      2345 non-null object
units        2345 non-null int64
unitprice    2345 non-null float64
dtypes: datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 128.3+ KB

In [25]:
data2.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2345 entries, 0 to 2344
Data columns (total 7 columns):
name         2345 non-null object
birthday     2345 non-null datetime64[ns]
customer     2345 non-null object
orderdate    2345 non-null datetime64[ns]
product      2345 non-null object
units        2345 non-null int64
unitprice    2345 non-null float64
dtypes: datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 561.5 KB

### JSON

In [26]:
sales_data_json = pd.read_json('../data/blooth_sales_data.json')
sales_data_json.head(5)

,birthday,customer,name,orderdate,product,unitprice,units
0,1974-01-07,Frontier Industries,Ernesto,2016-10-06 08:21:20.544568,Star Wars,11.81,27
1,1986-02-05,Bell Telecom Limited,Queen,2016-09-30 08:21:20.544599,PlayStation,284.71,1
2,1982-07-06,Software Co,Reid,2016-10-05 08:21:20.544622,banana,10.00,49
3,1971-04-12,Data Design Galaxy Co,Arlene,2016-10-02 08:21:20.544643,Thriller record,16.77,48
4,1984-12-14,Frontier Inc,Nikita,2016-10-16 08:21:20.544666,Harry Potter book,5.65,4

In [30]:
import json

In [32]:
j = json.load(open('../data/blooth_sales_data.json'))

In [33]:
j[0]

{'name': 'Ernesto',
 'birthday': '1974-01-07',
 'customer': 'Frontier Industries',
 'orderdate': '2016-10-06 08:21:20.544568',
 'product': 'Star Wars',
 'units': 27,
 'unitprice': 11.81}

In [34]:
type(j)

list

In [35]:
type(j[0])

dict

In [27]:
sales_data_json = pd.read_json('../data/blooth_sales_data.json')
sales_data_json.head(5)

,birthday,customer,name,orderdate,product,unitprice,units
0,1974-01-07,Frontier Industries,Ernesto,2016-10-06 08:21:20.544568,Star Wars,11.81,27
1,1986-02-05,Bell Telecom Limited,Queen,2016-09-30 08:21:20.544599,PlayStation,284.71,1
2,1982-07-06,Software Co,Reid,2016-10-05 08:21:20.544622,banana,10.00,49
3,1971-04-12,Data Design Galaxy Co,Arlene,2016-10-02 08:21:20.544643,Thriller record,16.77,48
4,1984-12-14,Frontier Inc,Nikita,2016-10-16 08:21:20.544666,Harry Potter book,5.65,4

In [28]:
sales_data_json.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2345 entries, 0 to 2344
Data columns (total 7 columns):
birthday     2345 non-null object
customer     2345 non-null object
name         2345 non-null object
orderdate    2345 non-null object
product      2345 non-null object
unitprice    2345 non-null float64
units        2345 non-null int64
dtypes: float64(1), int64(1), object(5)
memory usage: 128.3+ KB

**The JSON is not correctly formatted for datetime!**, should be ISO 8601 "YYYY-MM-DDTHH:MM:SS.NNNZ" e.g. 2012-04-23T18:25:43.511Z

One approach to slove it: read the json and create the DataFrame from a a list of dictionaries.

In [38]:
import json
with open('../data/blooth_sales_data.json', 'r') as f:
    _json = json.load(f)
_json[0]

{'name': 'Ernesto',
 'birthday': '1974-01-07',
 'customer': 'Frontier Industries',
 'orderdate': '2016-10-06 08:21:20.544568',
 'product': 'Star Wars',
 'units': 27,
 'unitprice': 11.81}

In [39]:
import datetime
for j in _json:
    j['orderdate'] = datetime.datetime.strptime(j['orderdate'], "%Y-%m-%d %H:%M:%S.%f").strftime("%Y-%m-%dT%H:%M:%SZ")
    j['birthday'] = datetime.datetime.strptime(j['birthday'], "%Y-%m-%d")
_json[0]

{'name': 'Ernesto',
 'birthday': datetime.datetime(1974, 1, 7, 0, 0),
 'customer': 'Frontier Industries',
 'orderdate': '2016-10-06T08:21:20Z',
 'product': 'Star Wars',
 'units': 27,
 'unitprice': 11.81}

In [40]:
sales_data_from_dict = pd.DataFrame(_json)
sales_data_from_dict.head(5)

,birthday,customer,name,orderdate,product,unitprice,units
0,1974-01-07,Frontier Industries,Ernesto,2016-10-06T08:21:20Z,Star Wars,11.81,27
1,1986-02-05,Bell Telecom Limited,Queen,2016-09-30T08:21:20Z,PlayStation,284.71,1
2,1982-07-06,Software Co,Reid,2016-10-05T08:21:20Z,banana,10.00,49
3,1971-04-12,Data Design Galaxy Co,Arlene,2016-10-02T08:21:20Z,Thriller record,16.77,48
4,1984-12-14,Frontier Inc,Nikita,2016-10-16T08:21:20Z,Harry Potter book,5.65,4

In [41]:
sales_data_from_dict.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2345 entries, 0 to 2344
Data columns (total 7 columns):
birthday     2345 non-null datetime64[ns]
customer     2345 non-null object
name         2345 non-null object
orderdate    2345 non-null object
product      2345 non-null object
unitprice    2345 non-null float64
units        2345 non-null int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 128.3+ KB

In [42]:
with open('../data/blooth_sales_data.json', 'r') as f:
    _json = json.load(f)
for j in _json:
    j['orderdate'] = datetime.datetime.strptime(j['orderdate'], "%Y-%m-%d %H:%M:%S.%f")
    j['birthday'] = datetime.datetime.strptime(j['birthday'], "%Y-%m-%d")
sales_data_from_dict = pd.DataFrame(_json)
sales_data_from_dict.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2345 entries, 0 to 2344
Data columns (total 7 columns):
birthday     2345 non-null datetime64[ns]
customer     2345 non-null object
name         2345 non-null object
orderdate    2345 non-null datetime64[ns]
product      2345 non-null object
unitprice    2345 non-null float64
units        2345 non-null int64
dtypes: datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 128.3+ KB

Probaly more efficient:

In [43]:
sales_data_json = pd.read_json('../data/blooth_sales_data.json',
                              convert_dates=['birthday', 'orderdate']
                              )
sales_data_json.head(5)

,birthday,customer,name,orderdate,product,unitprice,units
0,1974-01-07,Frontier Industries,Ernesto,2016-10-06 08:21:20.544568,Star Wars,11.81,27
1,1986-02-05,Bell Telecom Limited,Queen,2016-09-30 08:21:20.544599,PlayStation,284.71,1
2,1982-07-06,Software Co,Reid,2016-10-05 08:21:20.544622,banana,10.00,49
3,1971-04-12,Data Design Galaxy Co,Arlene,2016-10-02 08:21:20.544643,Thriller record,16.77,48
4,1984-12-14,Frontier Inc,Nikita,2016-10-16 08:21:20.544666,Harry Potter book,5.65,4

In [44]:
sales_data_json.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2345 entries, 0 to 2344
Data columns (total 7 columns):
birthday     2345 non-null datetime64[ns]
customer     2345 non-null object
name         2345 non-null object
orderdate    2345 non-null datetime64[ns]
product      2345 non-null object
unitprice    2345 non-null float64
units        2345 non-null int64
dtypes: datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 128.3+ KB

In [45]:
sales_data_json.describe()

          unitprice        units
count   2345.000000  2345.000000
mean    2329.681343    25.808102
std     6582.327614    14.474110
min        5.010000     1.000000
25%       10.660000    13.000000
50%       17.850000    26.000000
75%      489.940000    39.000000
max    24895.630000    50.000000

In [ ]:
sales_data.head(100000000)

### Working with Excel

In [46]:
sales_data_excel = pd.read_excel('../data/blooth_sales_data.xlsx',
                                usecols='A:B')
sales_data_excel.head(5)

       name   birthday
0  Pasquale 1967-09-02
1     India 1968-12-13
2     Wayne 1992-09-10
3      Cori 1986-11-05
4     Chang 1972-04-23

In [47]:
sales_data_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
name        1000 non-null object
birthday    1000 non-null datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 15.7+ KB

#### Exporting to Excel

In [48]:
sales_data_json.head(3)

,birthday,customer,name,orderdate,product,unitprice,units
0,1974-01-07,Frontier Industries,Ernesto,2016-10-06 08:21:20.544568,Star Wars,11.81,27
1,1986-02-05,Bell Telecom Limited,Queen,2016-09-30 08:21:20.544599,PlayStation,284.71,1
2,1982-07-06,Software Co,Reid,2016-10-05 08:21:20.544622,banana,10.00,49

In [49]:
sales_data_json.to_excel('../data/sales_data_json_exported.xlsx', 
                         index=False, 
                         sheet_name='Sales Data')
# ! make sure the .ext is correct - used to determine the export engine

**Example: Exporting bto Excel is very powerful when using the *xlsxwriter engine***

![title](../img/xlsxwriterexample.png)

For more see: http://xlsxwriter.readthedocs.io

### Reading from the Clipboard

In [50]:
# put this in your clipboard
sales_data_json.head(5)

,birthday,customer,name,orderdate,product,unitprice,units
0,1974-01-07,Frontier Industries,Ernesto,2016-10-06 08:21:20.544568,Star Wars,11.81,27
1,1986-02-05,Bell Telecom Limited,Queen,2016-09-30 08:21:20.544599,PlayStation,284.71,1
2,1982-07-06,Software Co,Reid,2016-10-05 08:21:20.544622,banana,10.00,49
3,1971-04-12,Data Design Galaxy Co,Arlene,2016-10-02 08:21:20.544643,Thriller record,16.77,48
4,1984-12-14,Frontier Inc,Nikita,2016-10-16 08:21:20.544666,Harry Potter book,5.65,4

In [52]:
sales_from_clipboard = pd.read_clipboard()
sales_from_clipboard.head(5)

                                                                                       BCH-USD
Bitcoin  Cash        USD     345.6400 -3.79    -1.08% 6.331B  4.004B  4.004B  4.004B   18.318M
Tether   USDUSDT-USD NaN    NaN       NaN      NaN    NaN     NaN     NaN     NaN         None
         USD         1.0017  0.0037   +0.3673% 4.650B 43.928B 43.928B 43.928B 4.642B      None
Litecoin USDLTC-USD  NaN    NaN       NaN      NaN    NaN     NaN     NaN     NaN         None
         USD         62.90  -0.2400   -0.38%   4.041B 4.472B  4.472B  4.472B  64.239M     None

### Summary

* reading and writing data is simple with Pandas
* very customizable imports
* the many options can be overwhelming for beginners - be patient with yourself
* a lot of the handling is done by Pandas by default, e.g.:
    * header
    * datatype (int/float, but not datetime)
    * skipping blank lines
    * …
* data cleansing (datetime example above) can also be done in pandas directly, we'll see later.
* exporting data is simple,…
* caveats:
    * Columns with NaN values become floats

End of our light warm-up.